input_files/C3-high_pressure_gradient-16%_mineral_proportion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.1;

vertices
(
    (-0.01 -0.01 -0.0035)
    (0.101 -0.01 -0.0035)
    (0.101 0.101 -0.0035)
    (-0.01 0.101 -0.0035)
    (-0.01 -0.01 0.005)
    (0.101 -0.01 0.005)
    (0.101 0.101 0.005)
    (-0.01 0.101 0.005)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (175 175 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet 
    {
        type patch;
        faces
        (
            (7 3 0 4)
        );
    }
    outlet 
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    north 
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    south 
    {
        type patch;
        faces
        (
            (4 0 1 5)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
